# My Baseline with CBAM Integrated

# Parameters
nc: 6 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
#  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs (original, will increase slightly after CBAM)
#  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
#  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
#  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone with CBAM
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, CBAM, [256]] # NEW: CBAM after C3k2 (channels=256, auto-infer or specify)
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8 (original 3, shifted +1)
  - [-1, 2, C3k2, [512, False, 0.25]] # 5
  - [-1, 1, CBAM, [512]] # NEW: CBAM after C3k2
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16 (original 5, shifted +2)
  - [-1, 2, C3k2, [512, True]] # 8
  - [-1, 1, CBAM, [512]] # NEW: CBAM after C3k2
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32 (original 7, shifted +3)
  - [-1, 2, C3k2, [1024, True]] # 11
  - [-1, 1, CBAM, [1024]] # NEW: CBAM after C3k2
  - [-1, 1, SPPF, [1024, 5]] # 13 (original 9, shifted +4)
  - [-1, 2, C2PSA, [1024]] # 14 (original 10, shifted +4)

# YOLO11n head with CBAM
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15 (shifted +4 from original)
  - [[-1, 8], 1, Concat, [1]] # 16 cat backbone P4 (original cat 6, now 8 due to shifts)
  - [-1, 2, C3k2, [512, False]] # 17 (original 13, shifted +4)
  - [-1, 1, CBAM, [512]] # NEW: CBAM after C3k2

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  - [[-1, 5], 1, Concat, [1]] # 20 cat backbone P3 (original cat 4, now 5)
  - [-1, 2, C3k2, [256, False]] # 21 (original 16, P3/8-small)
  - [-1, 1, CBAM, [256]] # NEW: CBAM after C3k2

  - [-1, 1, Conv, [256, 3, 2]] # 23
  - [[-1, 18], 1, Concat, [1]] # 24 cat head P4 (original cat 13, now 18 due to new CBAM in head)
  - [-1, 2, C3k2, [512, False]] # 25 (original 19, P4/16-medium)
  - [-1, 1, CBAM, [512]] # NEW: CBAM after C3k2

  - [-1, 1, Conv, [512, 3, 2]] # 27
  - [[-1, 14], 1, Concat, [1]] # 28 cat head P5 (original cat 10, now 14)
  - [-1, 2, C3k2, [1024, True]] # 29 (original 22, P5/32-large)
  - [-1, 1, CBAM, [1024]] # NEW: CBAM after C3k2

  - [[22, 26, 30], 1, Detect, [nc]] # Detect(P3, P4, P5) (original [16,19,22], adjusted for shifts and new layers)
